app/controllers/perguntas_controller.rb

  def index
    if params[:q]
      @perguntas = Pergunta.find(:all, :conditions => ['titulo like ?', "%#{params[:q]}%"])
    else
      @perguntas = Pergunta.all
---
SELECT * FROM `perguntas` WHERE (`perguntas`.`titulo` = 'quem') LIMIT 1
SELECT * FROM `perguntas`

  def show
    @pergunta = Pergunta.find(params[:id])
---
SELECT * FROM `perguntas` WHERE (`perguntas`.`id` = 1)

  def edit
    @pergunta = Pergunta.find(params[:id])
---
SELECT * FROM `perguntas` WHERE (`perguntas`.`id` = 3)

  def create
    @pergunta = Pergunta.new(params[:pergunta])

    respond_to do |format|
      if @pergunta.save
---
INSERT INTO `perguntas` (`updated_at`, `titulo`, `dica`, `created_at`) VALUES('2009-08-15 19:01:07', 'Quem descrobriu o brasil?', 'De portugal', '2009-08-15 19:01:07')

  def update
    @pergunta = Pergunta.find(params[:id])

    respond_to do |format|
      if @pergunta.update_attributes(params[:pergunta])
---
SELECT * FROM `perguntas` WHERE (`perguntas`.`id` = 1)
UPDATE `perguntas` SET `titulo` = 'Quem descobriu o brasil?', `dica` = '', `updated_at` = '2009-08-17 01:06:50' WHERE `id` = 1